In [20]:
import seaborn as sns
import pandas as pd

# Iris

In [ ]:
iris = sns.load_dataset('iris')

## a
붓꽃 종(species)별로 꽃잎길이(sepal_length), 꽃잎폭(sepal_width),
꽃받침길이(petal_length), 꽃받침폭(petal_width)의 평균, 표준편차 등
기초통계량(describe())을 구하시오.

## b
3분위수(Q3)와 1분위수(Q1)의 차이보다 1.5배가 크거나 작은 데이터는 이상치이다.
즉,
* Q1 - 1.5 * (Q3 - Q1) 보다 작은 데이터
* Q3 + 1.5 * (Q3 - Q1) 보다 큰 데이터

이 이상치를 제거하고 위의 4가지 항목에 대해서 평균, 표준편차를 구하시오.

# Titanic

In [22]:
titanic = sns.load_dataset('titanic')

## a
타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만드시오. 
category1 카테고리는 다음과 같이 정의됨

1) 20살이 넘으면 성별을 그대로 사용한다.
2) 20살 미만이면 성별에 관계없이 “child”라고 한다.

In [23]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [24]:
titanic['category1'] =  titanic.apply(lambda x : "child" if x.age < 20 else "male" if x.sex=='male' else 'female', axis=1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,female
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male

## b
 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값
이 되도록 titanic 데이터프레임을 고치시오.

In [ ]:
mean_age = titanic.age.mean(axis=0)
titanic.age.fillna(mean_age, inplace=True)

## c
성별, 선실(class)별, 출발지(embark_town)별 생존율을 구하시오.

In [25]:
sex_group = titanic.groupby('sex')['survived']
sex_group.mean()
#titanic.pivot_table('survived', 'embark_town')

             survived
embark_town
Cherbourg    0.553571
Queenstown   0.389610
Southampton  0.336957

In [30]:
class_group = titanic.groupby('class')['survived']
class_group.mean()
titanic.pivot_table(index = 'survived', columns ='class')

         adult_male                            age                        \
class         First    Second     Third      First     Second      Third
survived
0          0.962500  0.938144  0.755376  43.695312  33.544444  26.555556
1          0.308824  0.091954  0.319328  35.368197  25.901566  20.646118

             alone                           fare  ...                parch  \
class        First    Second     Third      First  ...      Third     First
survived                                           ...
0         0.637500  0.701031  0.685484  64.684007  ...  13.669364  0.300000
1         0.426471  0.413793  0.579832  95.608029  ...  13.694887  0.389706

                             pclass                  sibsp
class       Second     Third  First Second Third     First    Second     Third
survived
0         0.144330  0.384409      1      2     3  0.287500  0.319588  0.672043
1         0.643678  0.420168      1      2     3  0.492647  0.494253  0.436975

[2 rows x 21 columns]

In [ ]:
embark_town_group = titanic.groupby('embark_town')['survived']
embark_town_group.mean()
#titanic.pivot_table('survived', 'embark_town')

embark_town
Cherbourg      0.553571
Queenstown     0.389610
Southampton    0.336957
Name: survived, dtype: float64

## d
타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나누고, 각 그룹별 생존율을 구하시오.
* bins = [1, 20, 30, 50, 70, 100]
* labels = ["미성년자", "청년", "중년", "장년", "노년"]

In [32]:
bins = [0, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
titanic["연령대"] = pd.cut(titanic.age, bins, labels=labels) 

titanic_age = pd.DataFrame(titanic.연령대.value_counts(), columns=["연령대"]) 
titanic_age["생존율"] = titanic.groupby('연령대')['survived'].mean()

In [ ]:
titanic_age

      연령대       생존율
청년    407  0.334152
중년    241  0.423237
미성년자  179  0.458101
장년     59  0.355932
노년      5  0.200000

## e
qcut 명령으로 세 개의 나이 그룹을 만들고, 나이 그룹별 남녀 성비와 생존율을 구하시오.

In [ ]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,연령대
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male,청년
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,중년
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,청년
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,중년
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male,중년
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male,청년
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,미성년자
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,female,청년
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male,청년
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male,중년

In [ ]:
titanic['age-group'] = pd.qcut(titanic.age, 3, labels=['젊은이', '중간', '늙은이'])
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,연령대,age-group
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male,청년,젊은이
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,중년,늙은이
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,청년,중간
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,중년,늙은이
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male,중년,늙은이
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male,청년,중간
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,미성년자,젊은이
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,female,청년,중간
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male,청년,중간
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male,중년,늙은이

In [ ]:
age_group_survived = titanic.groupby('age-group')['survived']
age_group_survived.mean()

age-group
젊은이    0.411960
중간     0.335526
늙은이    0.405594
Name: survived, dtype: float64

In [ ]:
titanic['sex_category'] = titanic.apply(lambda x : 1 if x.sex=='male' else 0, axis=1)
titanic['sex_category_f'] = titanic.apply(lambda x : 1 if x.sex=='female' else 0, axis=1)

titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,연령대,age-group,sex_category,sex_category_f
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male,청년,젊은이,1,0
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,중년,늙은이,0,1
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,청년,중간,0,1
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,중년,늙은이,0,1
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male,중년,늙은이,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male,청년,중간,1,0
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,미성년자,젊은이,0,1
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,female,청년,중간,0,1
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male,청년,중간,1,0
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male,중년,늙은이,1,0

In [ ]:
# 나이 그룹별 남자비율
age_group_survived = titanic.groupby('age-group')['sex_category']
age_group_survived.mean()

age-group
젊은이    0.594684
중간     0.680921
늙은이    0.667832
Name: sex_category, dtype: float64

In [ ]:
# 나이 그룹별 여자비율
age_group_survived_f = titanic.groupby('age-group')['sex_category_f']
age_group_survived_f.mean()

age-group
젊은이    0.405316
중간     0.319079
늙은이    0.332168
Name: sex_category_f, dtype: float64

#mpg

In [21]:
mpg = sns.load_dataset('mpg')

##3 - A

In [ ]:
df = mpg[['displacement','horsepower']]
df['hp_per_cc'] = df['displacement']/df['horsepower']
df.round(3)

In [37]:
#3. Mile per gallon a.
#mpg['hp_per_cc'] = mpg.horsepower / mpg.displacemnet

##3-B

In [ ]:
def listToString(str_list):
    result = ""
    for s in str_list:
        result += s + " "
    return result.strip()
df1=mpg['name']

In [43]:
df_list=[]
for i in range(len(df1)):
  if len(df1[i].split())==6:
    a = df1[i].split()
    df_list.append(a[0])
  if len(df1[i].split())==5:
    a = df1[i].split()
    df_list.append(a[0])
  if len(df1[i].split())==4:
    a = df1[i].split()
    df_list.append(a[0])
  if len(df1[i].split())== 3:
    a = df1[i].split()
    df_list.append(a[0])
  if len(df1[i].split())==2:
    a = df1[i].split()
    df_list.append(a[0])
  if len(df1[i].split())==1:
    a = df1[i].split()
    df_list.append(a[0])

In [ ]:
df_list1=[]
for i in range(len(df1)):
  if len(df1[i].split())==6:
    a = df1[i].split()
    b = listToString(a[1:])
    df_list1.append(b)
  if len(df1[i].split())==5:
    a = df1[i].split()
    b = listToString(a[1:])
    df_list1.append(b)
  if len(df1[i].split())==4:
    a = df1[i].split()
    b = listToString(a[1:])
    df_list1.append(b)
  if len(df1[i].split())== 3:
    a = df1[i].split()
    b = listToString(a[1:])
    df_list1.append(b)
  if len(df1[i].split())==2:
    a = df1[i].split()
    b = listToString(a[1:])
    df_list1.append(b)
  if len(df1[i].split())==1:
    a = df1[i].split()
    b = listToString(a[1:])
    df_list1.append(b)

In [ ]:
mpg['manufacturer']=df_list
mpg['model']=df_list1
ans=mpg.drop(columns = ['name'])
ans

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,manufacturer,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet,chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick,skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth,satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc,rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford,torino
...,...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford,mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw,pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge,rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford,ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy,s-10

In [ ]:
# manufacture와 model 컬럼
#mpg['manufacture'] = mpg.name.apply(lambda x : x.split()[0])
#mpg['model'] = mpg.name.apply(lambda x : " ".join(x.split()[1:]))
#mpg.drop(columns=['name'], inplace=True)

##3-C

In [34]:
mpg.groupby('cylinders')['mpg'].mean()
#mpg.pivot_table('mpg', 'cylinders')

cylinders
3    20.550000
4    29.286765
5    27.366667
6    19.985714
8    14.963107
Name: mpg, dtype: float64

##3-D

In [38]:
#mpg.pivot_table('hp_per_cc','origin')

##3-E

In [45]:
fin = ans[['mpg','manufacturer']]
mpg_model = pd.pivot_table(ans, index = 'manufacturer',values = 'model', aggfunc='count').drop_duplicates ()
a = mpg_model[mpg_model.values >5].index
new_ = []
no = []
for i in range(len(fin)):
  if (fin['manufacturer'][i] in a) & (fin['manufacturer'][i] not in no):
    new_.append(fin['mpg'][i])
    no.append(fin['manufacturer'][i])
answer = pd.DataFrame(new_,a)
a = answer[0]
a.sort_values(ascending =False).head(5)

manufacturer
plymouth    30.0
ford        27.0
honda       26.0
fiat        24.0
mazda       24.0
Name: 0, dtype: float64

In [44]:
#mpg.manufacture.value_counts() >=5
#s =mpg.manufacture.value_counts()
#big = s[s > 5].index.tolist()
#mpg 데이터에서 big에 속하는 것만 나오도록 필터링
#mpg[mpg.manufacture.isin(big)]
#big_mpg = mpg[mpg.manufacture.isin(big)]
#big_mpg.pivot_table('mpg','manufacture').sort_values(by='mpg',ascending ="False")

In [47]:
#new_mpg = mpg.groupby('manufacture').filter(lambda x : x.manufacture.count() >=5)
#new_mpg.pivot_table('mpg', 'manufacture').sort_values(by='mpg', ascending =False).head(5)

KeyError: ignored